jayis1/ghostblade/firmware/rp2350b/src/lms7002m_driver.c
/*
 * lms7002m_driver.c — LMS7002M SDR Transceiver Driver for RP2350B
 *
 * Copyright (C) 2026 GhostBlade Project
 * SPDX-License-Identifier: GPL-2.0-or-later
 *
 * This file implements the LMS7002M SDR transceiver control interface
 * for the GhostBlade board. The LMS7002M is connected to the RP2350B
 * via SPI1 (dedicated SPI bus with GPIO chip select).
 *
 * The LMS7002M is a multi-band RF transceiver supporting:
 *   - Frequency range: 100 kHz to 3.8 GHz
 *   - Bandwidth: 2 MHz to 61.44 MHz
 *   - MIMO: 2×2 (TX/RX)
 *   - Sample rates: up to 61.44 MSPS per channel
 *   - 12-bit ADC/DAC resolution
 *
 * On the GhostBlade board:
 *   - SPI1 master is used for LMS7002M configuration (up to 50 MHz SPI)
 *   - MIPI-CSI-2 carries IQ data directly to the RK3576
 *   - GPIO controls TX/RX enable and LNA
 *   - Active-low reset (PIN_SDR_RESET)
 *
 * Reference: LMS7002M Datasheet (v3.1r0), LMS7002M Programming and
 * Calibration Guide (v1.0r1)
 */

#include <stdint.h>
#include <stdbool.h>
#include <stddef.h>          /* NULL */
#include "lms7002m_driver.h"
#include "board_pins.h"
#include "rp2350b_init.h"    /* rp2350b_gpio_set() */

/* ========================================================================
 * LMS7002M SPI Protocol
 *
 * The LMS7002M SPI interface uses 16-bit word transfers:
 *   Write: [0] [1] [R/W=0] [Addr(6:0)] [Data(7:0)]
 *   Read:  [0] [1] [R/W=1] [Addr(6:0)] [Dummy(7:0)] → [Data(7:0)]
 *
 * The full 32-bit SPI frame format:
 *   Bits [31:30] = 00 (reserved, must be 0)
 *   Bit  [29]    = R/W (0=write, 1=read)
 *   Bits [28:16]  = Address (13 bits, but only lower 7 used for reg access)
 *   Bits [15:0]   = Data (16 bits)
 *
 * For register access, the address space is 0x0000-0x7FFF with
 * 16-bit data per register. Burst mode auto-increments the address.
 * ======================================================================== */

/* SPI command encoding */
#define LMS7002M_SPI_WRITE      0x00000000UL
#define LMS7002M_SPI_READ       0x20000000UL
#define LMS7002M_SPI_ADDR_MASK  0x3FFF0000UL
#define LMS7002M_SPI_DATA_MASK  0x0000FFFFUL
#define LMS7002M_SPI_ADDR_SHIFT  16

/* ========================================================================
 * LMS7002M Register Addresses (Key Configuration Registers)
 *
 * These are the primary registers needed for basic SDR configuration.
 * The full register map is documented in the LMS7002M Programming Guide.
 * ======================================================================== */

/* General Configuration */
#define LMS7002M_REG(x)           ((uint16_t)(x))

/* Reference clock and PLL registers (0x0020-0x002F) */
#define REG_REFCLK_DIV             LMS7002M_REG(0x0020)
#define REG_SYNTH_EN              LMS7002M_REG(0x0021)
#define REG_CGP_INT               LMS7002M_REG(0x0022)
#define REG_CGP_FRAC              LMS7002M_REG(0x0023)
#define REG_VCOCAP                LMS7002M_REG(0x0024)

/* TX PLL registers */
#define REG_TX_PLL_INT             LMS7002M_REG(0x0100)
#define REG_TX_PLL_FRAC            LMS7002M_REG(0x0101)
#define REG_TX_PLL_VCOCAP          LMS7002M_REG(0x0102)

/* RX PLL registers */
#define REG_RX_PLL_INT             LMS7002M_REG(0x0200)
#define REG_RX_PLL_FRAC            LMS7002M_REG(0x0201)
#define REG_RX_PLL_VCOCAP          LMS7002M_REG(0x0202)

/* Transceiver configuration (0x0100-0x01FF for TX, 0x0200-0x02FF for RX) */
#define REG_XBIAS                  LMS7002M_REG(0x0081)
#define REG_XBUF                   LMS7002M_REG(0x0082)
#define REG_XRXBUF                 LMS7002M_REG(0x0083)
#define REG_XTXBUF                 LMS7002M_REG(0x0084)

/* RX and TX enable / data path */
#define REG_EN_DIR                 LMS7002M_REG(0x0240)
#define REG_EN_LNA                 LMS7002M_REG(0x0241)

/* LNA and TIA registers (RX path) */
#define REG_RFE_LNA_GAIN           LMS7002M_REG(0x0250)
#define REG_RFE_LNA_MODE           LMS7002M_REG(0x0251)
#define REG_RFE_TIA_GAIN           LMS7002M_REG(0x0252)

/* Baseband filter registers */
#define REG_TDD_BBFLT              LMS7002M_REG(0x0300)
#define REG_RX_BBFILT              LMS7002M_REG(0x0301)
#define REG_TX_BBFILT              LMS7002M_REG(0x0302)

/* Decimation / Interpolation */
#define REG_RX_DECIMATION          LMS7002M_REG(0x0310)
#define REG_TX_INTERPOLATION       LMS7002M_REG(0x0311)

/* Power down and enable registers */
#define REG_POWER_DOWN             LMS7002M_REG(0x0092)
#define REG_TX_ENABLE              LMS7002M_REG(0x0093)
#define REG_RX_ENABLE              LMS7002M_REG(0x0094)

/* SPI data interface */
#define REG_SPI_DATA_IN            LMS7002M_REG(0x0086)
#define REG_SPI_DATA_OUT           LMS7002M_REG(0x0087)

/* ========================================================================
 * SPI1 Master Transfer Functions
 * ======================================================================== */

/* SPI1 data register for master transfers */
#define SPI1_SSPDR               (0x48070000UL + 0x008)
#define SPI1_SSPSR               (0x48070000UL + 0x00C)

#define REG32(addr)               (*(volatile uint32_t *)(addr))

/**
 * lms7002m_spi_xfer — Transfer 32 bits to/from LMS7002M via SPI1
 *
 * @tx_data: 32-bit word to send
 * Returns: 32-bit word received
 *
 * The LMS7002M SPI uses 32-bit transfers with the MSB-first format:
 *   Bits [31:30] = 00 (reserved)
 *   Bit  [29]    = R/W (0=write, 1=read)
 *   Bits [28:16] = Address
 *   Bits [15:0]  = Data (write) or Dummy (read)
 */
static uint32_t lms7002m_spi_xfer(uint32_t tx_data) {
    volatile uint32_t *dr = (volatile uint32_t *)SPI1_SSPDR;
    const volatile uint32_t *sr = (const volatile uint32_t *)SPI1_SSPSR;
    uint32_t timeout;

    /* Wait until TX FIFO has space (with timeout to prevent hang) */
    timeout = 100000;
    while (!(*sr & (1 << 1)))  /* TNF: TX FIFO not full */
        if (--timeout == 0)
            return 0xFFFFFFFF;  /* SPI bus stuck */

    /* Write 32-bit data */
    *dr = tx_data;

    /* Wait until RX FIFO has data (with timeout) */
    timeout = 100000;
    while (!(*sr & (1 << 2)))  /* RNE: RX FIFO not empty */
        if (--timeout == 0)
            return 0xFFFFFFFF;  /* SPI transfer timeout */

