jayis1/ghostblade/firmware/rp2350b/src/lms7002m_driver.c
    /* Read 32-bit data */
    return *dr;
}

/**
 * lms7002m_cs_assert — Assert LMS7002M chip select
 */
static void lms7002m_cs_assert(void) {
    /* Deassert CC1101 CSn first (shared SPI1 bus) */
    rp2350b_gpio_set(PIN_CC_SPI_CSN, true);

    /* Assert LMS7002M CSn (active-low) */
    rp2350b_gpio_set(PIN_SDR_SPI_CSN, false);

    /* CS setup time: LMS7002M requires >10 ns */
    for (volatile int i = 0; i < 2; i++)
        __asm__("nop");
}

/**
 * lms7002m_cs_release — Release LMS7002M chip select
 */
static void lms7002m_cs_release(void) {
    rp2350b_gpio_set(PIN_SDR_SPI_CSN, true);

    /* CS hold time */
    for (volatile int i = 0; i < 2; i++)
        __asm__("nop");
}

/* ========================================================================
 * LMS7002M Register Access Functions
 * ======================================================================== */

/**
 * lms7002m_write_reg — Write a 16-bit value to an LMS7002M register
 *
 * @addr: Register address (0x0000-0x7FFF)
 * @data: 16-bit data to write
 */
static void lms7002m_write_reg(uint16_t addr, uint16_t data) {
    uint32_t spi_cmd;

    spi_cmd = LMS7002M_SPI_WRITE
            | ((uint32_t)(addr & 0x3FFF) << LMS7002M_SPI_ADDR_SHIFT)
            | ((uint32_t)data & 0xFFFF);

    lms7002m_cs_assert();
    lms7002m_spi_xfer(spi_cmd);
    lms7002m_cs_release();
}

/**
 * lms7002m_read_reg — Read a 16-bit value from an LMS7002M register
 *
 * @addr: Register address (0x0000-0x7FFF)
 * Returns: 16-bit register value
 */
static uint16_t lms7002m_read_reg(uint16_t addr) {
    uint32_t spi_cmd;
    uint32_t rx_data;

    spi_cmd = LMS7002M_SPI_READ
            | ((uint32_t)(addr & 0x3FFF) << LMS7002M_SPI_ADDR_SHIFT);

    /* LMS7002M read: single CS assertion, two 32-bit transfers.
     * First transfer sends the read command (with dummy data).
     * Second transfer sends dummy 0x0000 and captures the response.
     * Both transfers must happen within the same CS assertion cycle. */
    lms7002m_cs_assert();
    /* First transfer: send read command */
    lms7002m_spi_xfer(spi_cmd);
    /* Second transfer: send dummy, capture response */
    rx_data = lms7002m_spi_xfer(0x00000000);
    lms7002m_cs_release();

    return (uint16_t)(rx_data & 0xFFFF);
}

/**
 * lms7002m_write_burst — Write multiple consecutive registers
 *
 * @start_addr: Starting register address
 * @data:        Array of 16-bit values to write
 * @count:       Number of registers to write
 */
static void lms7002m_write_burst(uint16_t start_addr,
                                    const uint16_t *data, uint16_t count) {
    if (!data || count == 0)
        return;
    for (uint16_t i = 0; i < count; i++) {
        lms7002m_write_reg(start_addr + i, data[i]);
    }
}

/* ========================================================================
 * PLL Frequency Calculation
 * ======================================================================== */

/*
 * The LMS7002M uses a fractional-N PLL for frequency synthesis.
 *
 * The VCO frequency is calculated as:
 *   f_VCO = f_REF * (N_INT + N_FRAC / 2^23) / 2
 *
 * Where:
 *   f_REF = reference clock frequency (typically 30.72 MHz)
 *   N_INT = integer part of the PLL division ratio
 *   N_FRAC = fractional part (0 to 2^23-1)
 *
 * The output frequency is:
 *   f_OUT = f_VCO / DIV_RATIO
 *
 * DIV_RATIO is 1, 2, 4, 8, 16, 32, or 64 depending on the
 * selected VCO divider.
 *
 * For the GhostBlade board, the reference clock is 30.72 MHz
 * from the on-board TCXO.
 */

#define LMS7002M_REF_FREQ_HZ       30720000UL   /* 30.72 MHz TCXO */
#define LMS7002M_FRAC_BITS          23           /* Fractional PLL resolution */
#define LMS7002M_FRAC_MODULO        (1UL << 23)  /* 2^23 = 8388608 */

/**
 * lms7002m_calc_pll_params — Calculate PLL integer and fractional parameters
 *
 * @freq_hz:    Target frequency in Hz (100 kHz to 3.8 GHz)
 * @n_int:      Output: PLL integer division ratio
 * @n_frac:     Output: PLL fractional division ratio
 * @div_ratio:  Output: VCO divider ratio (1, 2, 4, 8, 16, 32, or 64)
 *
 * The VCO operates in the range 2.4-3.8 GHz. The divider brings
 * the output down to the desired frequency.
 *
 * Returns: 0 on success, -1 on error (frequency out of range)
 */
static int lms7002m_calc_pll_params(uint32_t freq_hz,
                                      uint16_t *n_int, uint32_t *n_frac,
                                      uint8_t *div_ratio) {
    uint32_t vco_freq;
    uint64_t n_total;
    uint8_t div;

    /* Validate frequency range */
    if (freq_hz < 100000UL || freq_hz > 3800000000UL)
        return -1;

    /* Select VCO divider based on target frequency.
     * VCO range: 2.4 - 3.8 GHz
     * We need f_VCO = freq * div_ratio to be within VCO range. */
    if (freq_hz >= 2400000000UL) {
        div = 1;   /* No division needed */
    } else if (freq_hz >= 1200000000UL) {
        div = 2;
    } else if (freq_hz >= 600000000UL) {
        div = 4;
    } else if (freq_hz >= 300000000UL) {
        div = 8;
    } else if (freq_hz >= 150000000UL) {
        div = 16;
    } else if (freq_hz >= 75000000UL) {
        div = 32;
    } else {
        div = 64;
    }

    vco_freq = freq_hz * div;

    /* Verify VCO frequency is in range */
    if (vco_freq < 2400000000UL || vco_freq > 3800000000UL) {
        /* Try the next divider if possible */
        if (div < 64) {
            div *= 2;
            vco_freq = freq_hz * div;
            if (vco_freq < 2400000000UL || vco_freq > 3800000000UL)
                return -1;
        } else {
            return -1;
        }
    }

    /* Calculate PLL parameters:
     * f_VCO = f_REF * (N_INT + N_FRAC / 2^23) / 2
     * N_TOTAL = N_INT + N_FRAC / 2^23 = 2 * f_VCO / f_REF
     *
     * Cast vco_freq to uint64_t BEFORE multiplying by 2 to prevent
     * uint32_t overflow: at f_VCO = 3.8 GHz, vco_freq * 2 = 7.6 GHz
     * which exceeds UINT32_MAX (4.29 GHz). The previous code performed
     * the multiply in 32-bit before the 64-bit cast, causing silent
     * overflow and incorrect PLL programming at high VCO frequencies.
     */
    n_total = ((uint64_t)vco_freq * 2ULL * LMS7002M_FRAC_MODULO) / LMS7002M_REF_FREQ_HZ;

    *n_int = (uint16_t)(n_total / LMS7002M_FRAC_MODULO);
    *n_frac = (uint32_t)(n_total % LMS7002M_FRAC_MODULO);
    *div_ratio = div;

