jayis1/ghostblade/firmware/rp2350b/src/lms7002m_driver.c
    return 0;
}

/* ========================================================================
 * Public API Implementation
 * ======================================================================== */

/**
 * lms7002m_init — Initialize the LMS7002M SDR transceiver
 *
 * Performs a full initialization sequence:
 *   1. Assert and release hardware reset
 *   2. Power up the chip
 *   3. Configure the reference clock (30.72 MHz TCXO)
 *   4. Configure default RX parameters (868 MHz, 2 MHz BW, 30 dB gain)
 *   5. Enable RX path (but not TX — requires explicit enable)
 *
 * Returns: 0 on success, negative on error
 */
int lms7002m_init(void) {
    uint16_t reg_val;

    /* Step 1: Hardware reset sequence.
     * The LMS7002M reset is active-low (PIN_SDR_RESET).
     * rp2350b_init() already released the reset, but we cycle it here
     * to ensure a clean state. */
    rp2350b_gpio_set(PIN_SDR_RESET, false);  /* Assert reset */
    for (volatile int i = 0; i < 15000; i++)   /* ~1 ms */
        __asm__("nop");
    rp2350b_gpio_set(PIN_SDR_RESET, true);   /* Release reset */
    for (volatile int i = 0; i < 150000; i++)  /* ~10 ms for PLL startup */
        __asm__("nop");

    /* Step 2: Verify SPI communication by reading the ID register.
     * LMS7002M should return a known value at the status register. */
    reg_val = lms7002m_read_reg(0x002F);
    /* If we read 0xFFFF, the chip is not responding */
    if (reg_val == 0xFFFF) {
        return -1;  /* SPI communication failure */
    }

    /* Step 3: Power-down all blocks first, then selectively enable.
     * This ensures a known clean state regardless of previous configuration. */
    lms7002m_write_reg(REG_POWER_DOWN, 0x03FF);  /* Power down all */
    for (volatile int i = 0; i < 1500; i++)
        __asm__("nop");  /* ~100 μs */

    /* Step 4: Enable the reference clock path and PLL. */
    lms7002m_write_reg(REG_REFCLK_DIV, 0x0000);  /* No reference clock division */
    lms7002m_write_reg(REG_SYNTH_EN, 0x0001);   /* Enable synthesizer */

    /* Step 5: Configure RX path for default settings.
     * Using channel A (LNAW path) at 868 MHz as default. */
    lms7002m_tune_rx(868000000UL, 2000, 300);

    /* Step 6: Enable RX path only (TX requires explicit enable) */
    lms7002m_write_reg(REG_RX_ENABLE, 0x0001);   /* Enable RX */
    lms7002m_write_reg(REG_TX_ENABLE, 0x0000);   /* TX disabled */

    /* Step 7: Configure baseband filter and decimation.
     * Default: 2 MHz bandwidth, 256 ksps sample rate (decimation=122) */
    lms7002m_set_rx_bandwidth(2000);   /* 2 MHz bandwidth */
    lms7002m_set_rx_decimation(16);     /* Decimation by 16 for ~256 ksps */

    return 0;
}

/**
 * lms7002m_tune_rx — Tune the LMS7002M RX frequency
 *
 * @freq_hz:    Center frequency in Hz (100 kHz to 3.8 GHz)
 * @bw_khz:     Bandwidth in kHz (ignored if <= 0)
 * @gain_db_x10: LNA gain in dB × 10 (e.g., 300 = 30.0 dB)
 *
 * Configures the RX PLL, VCO divider, baseband filter, and LNA gain.
 */
void lms7002m_tune_rx(uint32_t freq_hz, uint16_t bw_khz, uint16_t gain_db_x10) {
    uint16_t n_int;
    uint32_t n_frac;
    uint8_t div_ratio;

    if (lms7002m_calc_pll_params(freq_hz, &n_int, &n_frac, &div_ratio) != 0)
        return;  /* Invalid frequency */

    /* Program RX PLL integer and fractional dividers */
    lms7002m_write_reg(REG_RX_PLL_INT, n_int);
    lms7002m_write_reg(REG_RX_PLL_FRAC, (uint16_t)(n_frac & 0xFFFF));
    lms7002m_write_reg(REG_RX_PLL_FRAC + 1, (uint16_t)((n_frac >> 16) & 0x007F));

    /* Program VCO divider */
    /* DIV_RATIO is encoded in the CGP register:
     * 0=div1, 1=div2, 2=div4, 3=div8, 4=div16, 5=div32, 6=div64 */
    uint16_t div_enc = 0;
    switch (div_ratio) {
    case 1:  div_enc = 0; break;
    case 2:  div_enc = 1; break;
    case 4:  div_enc = 2; break;
    case 8:  div_enc = 3; break;
    case 16: div_enc = 4; break;
    case 32: div_enc = 5; break;
    case 64: div_enc = 6; break;
    default: div_enc = 0; break;
    }
    uint16_t cgp_reg = lms7002m_read_reg(REG_CGP_INT);
    cgp_reg = (cgp_reg & 0xFF8F) | (div_enc << 4);
    lms7002m_write_reg(REG_CGP_INT, cgp_reg);

    /* Set bandwidth if specified */
    if (bw_khz > 0) {
        lms7002m_set_rx_bandwidth(bw_khz);
    }

    /* Set LNA gain */
    lms7002m_set_rx_gain(gain_db_x10);

    /* Allow PLL to lock (~200 μs) */
    for (volatile int i = 0; i < 30000; i++)
        __asm__("nop");
}

/**
 * lms7002m_set_rx_bandwidth — Set the LMS7002M RX baseband filter bandwidth
 *
 * @bw_khz: Bandwidth in kHz (e.g., 2000 for 2 MHz)
 *
 * Configures the RX baseband filter bandwidth and adjusts the
 * decimation ratio to maintain the desired sample rate.
 */
void lms7002m_set_rx_bandwidth(uint16_t bw_khz) {
    /* Baseband filter bandwidth is controlled by the RX_BBFILT register.
     * The LMS7002M supports bandwidths from ~1.5 MHz to ~61.44 MHz.
     *
     * Simplified mapping for common bandwidths:
     *   BW_kHz → RX_BBFILT value (approximate)
     *
     * For now, use a simplified direct mapping. The actual LMS7002M
     * bandwidth configuration requires calibration table lookup
     * and is typically done via LimeSuite calibration. */
    uint16_t bb_val;

    /* Reject zero/negative bandwidth to prevent invalid filter config */
    if (bw_khz == 0)
        return;

    if (bw_khz <= 1500)
        bb_val = 0x0C00;  /* ~1.5 MHz */
    else if (bw_khz <= 2500)
        bb_val = 0x0A00;  /* ~2.5 MHz */
    else if (bw_khz <= 5000)
        bb_val = 0x0800;  /* ~5 MHz */
    else if (bw_khz <= 10000)
        bb_val = 0x0400;  /* ~10 MHz */
    else if (bw_khz <= 20000)
        bb_val = 0x0200;  /* ~20 MHz */
    else
        bb_val = 0x0100;  /* >20 MHz (up to 61.44 MHz) */

    lms7002m_write_reg(REG_RX_BBFILT, bb_val);
}

/**
 * lms7002m_set_rx_gain — Set the LNA gain for the RX path
 *
 * @gain_db_x10: Gain in dB × 10 (e.g., 300 = 30.0 dB)
 *
 * Maps the gain value to LMS7002M LNA and TIA gain settings.
 * The LMS7002M has ~73 dB of total RX gain range, configurable
 * via LNA gain steps and TIA gain control.
 */
void lms7002m_set_rx_gain(uint16_t gain_db_x10) {
    /* LMS7002M LNA gain control:
     * The RFE_LNA_GAIN register controls the LNA gain in ~3 dB steps.
     * The TIA gain provides additional ~12 dB of gain control.
     *
     * Simplified mapping (gain_db_x10 / 10 = gain in dB):
     *   0-15 dB: LNA lowest gain + TIA lowest
     *   15-30 dB: LNA medium gain
     *   30-45 dB: LNA high gain
     *   45-73 dB: LNA maximum gain + TIA maximum
     *
     * Clamp gain to valid range [0, 730] (0-73 dB) to prevent
     * out-of-range values from programming invalid register settings. */
    uint16_t lna_gain;
    uint16_t tia_gain;

    /* Clamp to maximum supported gain */
    if (gain_db_x10 > 730)
        gain_db_x10 = 730;

    if (gain_db_x10 < 150) {
        lna_gain = 0x00;  /* LNA minimum gain */
        tia_gain = 0x00;  /* TIA minimum gain */
    } else if (gain_db_x10 < 300) {
        lna_gain = 0x01;  /* LNA medium gain */
        tia_gain = 0x00;
    } else if (gain_db_x10 < 450) {
        lna_gain = 0x02;  /* LNA high gain */
        tia_gain = 0x01;
    } else {
        lna_gain = 0x03;  /* LNA maximum gain */
        tia_gain = 0x03;  /* TIA maximum gain */
    }

    lms7002m_write_reg(REG_RFE_LNA_GAIN, lna_gain);
    lms7002m_write_reg(REG_RFE_LNA_MODE, 0x0001);  /* LNAW path selected */
    lms7002m_write_reg(REG_RFE_TIA_GAIN, tia_gain);
}

/**
 * lms7002m_set_rx_decimation — Set the RX decimation ratio
 *
 * @decimation: Decimation factor (1, 2, 4, 8, 16, 32, or 64)
 *
 * The LMS7002M ADC runs at a fixed rate. Decimation reduces the
 * output sample rate:
 *   f_sample = f_ADC / decimation
 *   At 30.72 MHz ADC rate:
 *     div 1  = 30.72 MSPS
 *     div 2  = 15.36 MSPS
 *     div 4  = 7.68 MSPS
 *     div 8  = 3.84 MSPS
 *     div 16 = 1.92 MSPS
 *     div 32 = 960 kSPS
 *     div 64 = 480 kSPS
 */
void lms7002m_set_rx_decimation(uint16_t decimation) {
    /* Map decimation factor to register value.
     * REG_RX_DECIMATION format: bits[2:0] encode the factor.
     * 0=div1, 1=div2, 2=div4, 3=div8, 4=div16, 5=div32, 6=div64
     *
     * Only power-of-2 values (1, 2, 4, 8, 16, 32, 64) are supported.
     * Unsupported values fall back to div16 (default, ~1.92 MSPS). */
    uint16_t dec_val;

    switch (decimation) {
    case 1:   dec_val = 0; break;
    case 2:   dec_val = 1; break;
    case 4:   dec_val = 2; break;
    case 8:   dec_val = 3; break;
    case 16:  dec_val = 4; break;
    case 32:  dec_val = 5; break;
    case 64:  dec_val = 6; break;
    default:  dec_val = 4; break;  /* Default: div16 (~1.92 MSPS) */
    }

