jayis1/ghostblade/firmware/rp2350b/src/lms7002m_driver.c
    lms7002m_write_reg(REG_RX_DECIMATION, dec_val);
}

/**
 * lms7002m_enable_rx — Enable the LMS7002M RX path
 *
 * Enables the LNA, mixer, TIA, and ADC in the RX chain.
 * The LMS7002M starts producing IQ data on the MIPI CSI-2 interface.
 */
void lms7002m_enable_rx(void) {
    rp2350b_gpio_set(PIN_SDR_GPIO1, true);   /* RX enable */
    rp2350b_gpio_set(PIN_SDR_LNA_EN, true);  /* LNA enable */
    lms7002m_write_reg(REG_RX_ENABLE, 0x0001);
}

/**
 * lms7002m_disable_rx — Disable the LMS7002M RX path
 */
void lms7002m_disable_rx(void) {
    lms7002m_write_reg(REG_RX_ENABLE, 0x0000);
    rp2350b_gpio_set(PIN_SDR_GPIO1, false);  /* RX disable */
    rp2350b_gpio_set(PIN_SDR_LNA_EN, false); /* LNA disable */
}

/**
 * lms7002m_enable_tx — Enable the LMS7002M TX path
 *
 * Enables the DAC, mixer, PA driver, and power amplifier.
 * WARNING: Transmitting on many frequencies requires a license.
 */
void lms7002m_enable_tx(void) {
    rp2350b_gpio_set(PIN_SDR_GPIO0, true);  /* TX enable */
    lms7002m_write_reg(REG_TX_ENABLE, 0x0001);
}

/**
 * lms7002m_disable_tx — Disable the LMS7002M TX path
 */
void lms7002m_disable_tx(void) {
    lms7002m_write_reg(REG_TX_ENABLE, 0x0000);
    rp2350b_gpio_set(PIN_SDR_GPIO0, false);  /* TX disable */
}

/**
 * lms7002m_power_down — Put the LMS7002M into low-power mode
 *
 * Disables all blocks and sets the power-down register.
 */
void lms7002m_power_down(void) {
    lms7002m_write_reg(REG_TX_ENABLE, 0x0000);
    lms7002m_write_reg(REG_RX_ENABLE, 0x0000);
    lms7002m_write_reg(REG_POWER_DOWN, 0x03FF);  /* Power down all blocks */
    rp2350b_gpio_set(PIN_SDR_GPIO0, false);
    rp2350b_gpio_set(PIN_SDR_GPIO1, false);
    rp2350b_gpio_set(PIN_SDR_LNA_EN, false);
}

/**
 * lms7002m_read_rssi — Read the LMS7002M RSSI value
 *
 * Returns: RSSI in dBm × 10 (signed, e.g., -740 = -74.0 dBm)
 *
 * This is a simplified implementation that reads the LMS7002M
 * internal RSSI register. For accurate RSSI, the LMS7002M needs
 * to be in RX mode with AGC enabled.
 */
int16_t lms7002m_read_rssi(void) {
    /* The LMS7002M RSSI register provides an 8-bit signed value
     * that is approximately proportional to the received signal level.
     * The exact mapping requires calibration with a known signal source.
     *
     * Simplified formula: RSSI_dBm = register_value - 127 (approximate)
     * In dBm × 10: RSSI_x10 = (register_value - 127) * 10 */
    uint16_t raw = lms7002m_read_reg(0x0400);  /* RSSI register address */
    int16_t rssi_x10 = ((int16_t)(raw & 0xFF) - 127) * 10;
    return rssi_x10;
}

/**
 * lms7002m_get_field_strength_mv — Get estimated field strength in mV
 *
 * This provides a rough estimate of the RF field strength at the
 * antenna, useful for antenna testing and debug.
 *
 * Returns: Estimated field strength in mV (0-5000)
 */
uint16_t lms7002m_get_field_strength_mv(void) {
    int16_t rssi_x10 = lms7002m_read_rssi();
    /* Convert from dBm×10 to approximate mV across 50Ω:
     * V_rms = 10^((dBm + 13) / 20) * 1000 / sqrt(2) */
    /* Simplified: approximate mV from RSSI */
    int32_t rssi_dbm = rssi_x10 / 10;
    if (rssi_dbm < -100) rssi_dbm = -100;
    if (rssi_dbm > 0) rssi_dbm = 0;

    /* Very rough mapping: -100 dBm → 2 mV, 0 dBm → 224 mV */
    uint16_t mv = (uint16_t)((rssi_dbm + 100) * 224 / 100);
    return mv;
}